{
  "auto_mapping": null,
  "base_model_name_or_path": "distilbert-base-uncased",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "revision": null,
  "target_modules": [
    "q",
    "k",
    "v",
    "q_lin",
    "k_lin",
    "v_lin"
  ],
  "task_type": "SEQ_CLS"
}